OpenFOAM-v2506/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet/porosityBased/R_10x-init/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.001 0.001 0);

boundaryField
{
    frontBack
    {
        type            empty;
    }

    designWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    IEntranceWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    OEntranceWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    OREntranceWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }
    
    outlet-right
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
